{
  "speakers":[
  {
	"name":"Andres Almiray",
	"description":"Java/Groovy developer, Java Champion and JSR377 Spec Lead.",
	"biography":"Andres is a Java/Groovy developer, Java Champion and JSR377 Spec Lead, with more than 15 years of experience in software design and development. He has been involved in web and desktop application developments since the early days of Java. He is a true believer of open source and has participated in popular projects like Groovy, Griffon, JMatter and DbUnit, as well as starting his own projects (Json-lib, EZMorph, GraphicsBuilder, JideBuilder). Founding member and current project lead of the Griffon framework.",
	"image": "assets/img/speakers/AndresAlmiray.jpg",
	"url":"",
	"twitter":"https://twitter.com/aalmiray",
	"homepage":"http://www.jroller.com/aalmiray/"
  },
  {
	"name":"Christopher Batey",
	"description":"Software Engineer by trade and is currently employed by DataStax as a Technical Evangelist for Apache Cassandra.",
	"biography":"Christopher Batey (@chbatey) is a Software Engineer by trade and is currently employed by DataStax as a Technical Evangelist for Apache Cassandra. Chris has also worked for Sky, where he helped build their online television platform, and IBM, where he helped develop a variety of messaging products.<br>He spends a lot of his own time contributing back to the software community and is a active member of the London Java Community, Cassandra London and the London Software Craftsmanship Community. Christopher has a particular interest in building effective automated tests for every scenario, including network failures, database faults and services returning junk. For that reason he built an open source test double for Apache Cassandra: Stubbed Cassandra. He also blogs regularly at: http://christopher-batey.blogspot.co.uk/. ",
	"image": "assets/img/speakers/ChristopherBatey.jpg",
	"url":"",
	"twitter":"https://twitter.com/chbatey",
	"homepage":"http://christopher-batey.blogspot.co.uk/"
  },
  {
	"name":"David Brimley",
	"description":"Senior Solutions Architect for Hazelcast.",
	"biography":"David Brimley is a Senior Solutions Architect for Hazelcast, he helps companies get the best out of In Memory Data Grids. Previously David has held senior engineering positions at firms such as Credit Suisse, HSBC, Nomura and Royal Bank of Scotland. During this time he became familiar with IMDG products such as Pivotal Gemfire and Oracle Coherence. David has been a professional coder for over 25 years and confirmed coding addict for 10 years prior to that, a journey which began on a BBC Model B computer.",
	"image": "assets/img/speakers/DavidBrimley.png",
	"url":"",
	"twitter":"https://twitter.com/dbrimley",
	"homepage":"http://dbrimley.github.io"
  },
  {
	"name":"Rob Davies",
	"description":"Technical Director for Fuse Engineering at Red Hat, creator of ActiveMQ and ServiceMix.",
	"biography":"Rob Davies is the Technical Director for Fuse Engineering at Red Hat. Previously Rob was the CTO of FuseSource. The experts in open source integration and messaging. With 20 years experience of architecting solutions and developing products for large-scale distributed applications for telcos and finance, Rob is focusing on developing the next generation of open source middleware products for Red Hat.",
	"image": "assets/img/speakers/RobDavies.jpg",
	"url":"",
	"twitter":"https://twitter.com/rajdavies",
	"homepage":"http://rajdavies.blogspot.co.uk/"
  },
  {
	"name":"Claus Ibsen",
	"description":"Principal software engineer from Red Hat.",
	"biography":"Claus Ibsen is a principal software engineer from Red Hat. <br>Claus is working full time as Apache Camel committer. And is author of the Camel in Action book.<br>He is also heavily involved with fabric8 and hawtio projects, especially with functionality that involves Camel.",
	"image": "assets/img/speakers/ClausIbsen.jpg",
	"url":"",
	"twitter":"http://twitter.com/davsclaus",
	"homepage":"http://davsclaus.com"
  },  
    {
	"name":"Johan Janssen",
	"description":"Java lead developer / architect and Java trainer at Info Support.",
	"biography":"Johan is working as a Java lead developer / architect and Java trainer at Info Support. He has been working for various demanding companies where rapidly delivering quality software was very important. Currently he is working in a DevOps team in a big financial institution in The Netherlands as Java architect. He likes sharing his knowledge about Java, continuous delivery, DevOps, software quality and numerous other subjects. Johan regularly writes articles and gives presentations about those subject for instance at JavaOne, JavaLand, JavaCro and J-Fall.",
	"image": "assets/img/speakers/JohanJanssen.png",
	"url":"",
	"twitter":"https://twitter.com/johanjanssen42",
	"homepage":"https://blogs.infosupport.com/author/johanj/"
  },
    {
	"name":"Masoud Kalali",
	"description":"Software architect with focus on PaaS and Java EE, author, technology enthusiast.",
	"biography":"Masoud has been working on software development projects since 1998, which gives him a broad perspective on software development in general and changes in the software development landscape in the past 1/5 decades. Masoud has experience with variety of technologies (.NET, J2EE, CORBA, and COM+) on diverse platforms (Solaris, Linux, and Windows). He has a master degree in information systems with a bachelor degree in software engineering.<br>Masoud has authored fair number of articles and other types of publications including several articles at Java.net and Dzone. He is author of multiple refcards, published by Dzone, including but not limited to Using XML in Java, Security and GlassFish v3 refcardz. Masoud is one of the founding members of NetBeans Dream Team and a GlassFish community spotlighted developer. Masoud is author of GlassFish Security book published in 2010 covering GlassFish v3 security and Java EE 6 security. He recently co-authored another book Developing RESTful Services with JAX-RS 2.0, WebSockets, and JSON.<br>Masoud is a recurrent speaker in JavaOne and other Java focused conferences across europe.",
	"image": "assets/img/speakers/MasoudKalali.jpg",
	"url":"",
	"twitter":"https://twitter.com/MasoudKalali",
	"homepage":"http://about.me/masoudkalali"
  },
  {
	"name":"Willem Meints",
	"description":"Lead developer at knowNow.",
	"biography":"Willem is working as a lead developer for knowNow a social knowledge sharing platform for enterprise companies that strives to make sharing knowledge within organizations as easy as possible. Beside his work on knowNow he works as the Competence Centre Lead for enterprise mobile applications, a competence centre that helps projects get up to speed with Internet of Things and mobile within the enterprise. Willem likes to talk about his work, which he regularly does at conferences and the Dutch mobile meetup group.",
	"image": "assets/img/speakers/WillemMeints.jpg",
	"url":"",
	"twitter":"https://twitter.com/willem_meints",
	"homepage":"http://fizzylogic.nl/"  	
  },
  {
	"name":"Jean Baptiste Onofre",
	"description":"SOA/Software Architect at Talend and ASF member.",
	"biography":"Jean-Baptiste Onofré is an ASF member and committer of Apache Karaf, Apache ServiceMix, Apache ACE, Apache Camel, Apache Archiva, Apache Kalumet, Apache Falcon, Apache Syncope and mentor on Apache Sirona. He brings over ten years of development experience to Talend, where he works as a SOA/Software Architect. Also is the author of book 'Learning Apache Cellar'",
	"image": "assets/img/speakers/JeanBaptisteOnofre.jpg",
	"url":"",
	"twitter":"https://twitter.com/jbonofre",
	"homepage":"http://blog.nanthrax.net/"
  }
  ]
}
